#include "stdafx.h"

void func_1()
{
	// 假设现在有5个班，每个班10个人，设计一个二维数组存储这些人的年龄
	int arr[5][10] = { 
		{18, 19, 20, 17, 16, 17, 15, 14, 12, 11},
		{11, 13, 19, 20, 22, 15, 26, 17, 21, 12},
		{19, 10, 11, 12, 25, 34, 27, 16, 18, 14},
		{13, 24, 11, 12, 14, 15, 16, 19, 18, 22},
		{22, 24, 21, 30, 18, 19, 20, 19, 19, 18}
	};
	arr[1][5]; // 如果想知道第二个班的第6个人的年龄，应该如何获取？编译器该如何获取？
	arr[1 * 10 + 5]; // 编译器获取

	// 打印所有班级，所有学生的年龄(每个班级打印一行)
	for (int i = 0; i < 5; i++)
	{
		for (int j = 0; j < 10; j++)
		{
			printf("%d ", arr[i][j]);
		}
		printf("\n");
	}

	// 将第二个班级的超过20岁的学生的年龄修改为21岁

	for (int k = 0; k < 10; k++)
	{
		if (arr[1][k] >= 20)
		{
			arr[1][k] = 21;
		}
	}

	int z = 0;
	// 打印出每个班级学生的年龄的和	
	for (int x = 0; x < 5; x++)
	{
		for (int y = 0; y < 10; y++)
		{
			z += arr[x][y];
		}
		printf("%d\n", z);
		z = 0;
	}

}

void func_2()
{
	// 数组一：[3,5,7,9,12,25,34,55]
	// 数组二：[4,7,9,11,13,16]
	// 将两个数组中所有数据进行从小到大的排序，存储到另一个数组中
	// 注意: 两个数组需要是有序的

	int arr_1[8] = {3, 5, 7, 9, 12, 25, 34, 55};
	int arr_2[6] = {4, 7, 9, 11, 13, 16};
	int arr[14] = {0};
	for (int i = 0, j = 0, z = 0; z < 14; z++)
	{
		if (i > 7)
		{
			arr[z] = arr_2[j];
			j++;
			continue;
		}
		if (j > 5)
		{
			arr[z] = arr_1[i];
			i++;
			continue;
		}
		if (arr_1[i] <= arr_2[j])
		{
			arr[z] = arr_1[i];
			i++;
		}
		else
		{
			arr[z] = arr_2[j];
			j++;
		}
	}

	for (int k = 0; k < 14; k++)
	{
		printf("%d ", arr[k]);
	}

}

int main(int argc, char* argv[])
{
	func_1();
	func_2();
	return 0;
}